# 1 Выведите все четные элементы списка. При этом используйте цикл for,
# перебирающий элементы списка, а не их индексы!

# lst = list(input())
# for i in lst:
#
#     if int(i) % 2 != 0:
#         lst.pop(i)
# print(lst)




# 2 Задано два списка. Найти наименьшие среди элементов первого списка, которые не входят во второй список.
# a = list(input())
# b = list(input())
# if min(a) not in b:
#     print(min(a))
# if min(a) in b:


# 3 Задан список из k чисел. Определить количество инверсий в списке
# (т. е. таких пар элементов, в которых большее число находится слева от меньшего).

# 4 Программе подаётся на вход произвольная строка. Удалите из нее повторяющиеся символы
# (т. е. символы, встречающиеся в строке во второй или более раз) и выведите результат на экран.
# Задачу решить через список. Функцию set не использовать
# Sample Input 1:
# Ха-ха-ха-ха
# Sample Output 1:
# Ха-х

# 5 Дан список положительных целых чисел . Вставить после каждого чётного числа его перевёртыш.
# 18 81, 42 24, 8 8, 122 221
